{
  "bahasaSehariHari": [
    {
      "nama": "Indonesia",
      "tingkat": "Penutur Asli",
      "icon": "🇮🇩",
      "level": 100,
      "deskripsi": "Kemampuan linguistik setara dengan penutur asli terdidik, menguasai seluruh register bahasa dari percakapan kasual hingga wacana akademis dan sastra.",
      "penjelasan": "Bahasa Indonesia digunakan sehari-hari untuk komunikasi formal dan informal; penting untuk penulisan konten lokal, presentasi, dan dokumentasi budaya.",
      "tujuan": "Memfasilitasi komunikasi publik, pendidikan, dan media di Indonesia.",
      "manfaat": "Memungkinkan penyampaian ide kepada audiens lokal, produksi konten lokal, dan partisipasi sosial-ekonomi.",
      "asal": "Berasal dari rumpun Austronesia, berkembang di kepulauan Nusantara.",
      "fungsi": "Bahasa nasional, administrasi, pendidikan, dan media massa di Indonesia.",
      "kekurangan": "Variasi dialek dan idiom lokal dapat menyulitkan komunikasi antardaerah jika tidak disesuaikan.",
      "kelebihan": "Kaya kosakata budaya lokal dan fleksibel untuk mengadopsi istilah teknis.",
      "seberapaBanyakPengguna": "~270 juta penutur (L1 + L2, perkiraan)",
      "warna": "#FF0000",
      "kemampuan": ["Percakapan Formal & Informal", "Presentasi & Orasi", "Penulisan Kreatif & Teknis", "Debat & Negosiasi", "Penyuntingan Naskah", "Penerjemahan Tepat Nuansa"],
      "pengalaman": "Digunakan sebagai bahasa primer dalam semua aspek kehidupan selama lebih dari 20 tahun, termasuk pendidikan, pekerjaan, dan kreasi konten.",
      "detailTambahan": {
        "aksara": "Aksara Latin & Arab (Gundul)",
        "dialek": "Menguasai ragam Bahasa Indonesia Formal dan Bahasa Gaul terkini",
        "pencapaian": "Juara Debat Tingkat Regional, Penulis Konten Profesional"
      }
    },
    {
      "nama": "English",
      "tingkat": "Lanjutan (Advanced - C1)",
      "icon": "🇺🇸",
      "level": 80,
      "deskripsi": "Kemampuan komunikasi setara C1 CEFR. Lancar dan akurat dalam konteks profesional, akademis, dan sosial yang kompleks. Dapat mengekspresikan ide secara spontan tanpa kesalahan signifikan yang mengganggu komunikasi.",
      "penjelasan": "Bahasa Inggris dipakai untuk komunikasi internasional, dokumentasi teknis, dan presentasi profesional; penting untuk akses ke sumber daya global.",
      "tujuan": "Memungkinkan komunikasi lintas-bangsa dan akses ke literatur internasional.",
      "manfaat": "Membuka peluang kerja internasional, kolaborasi riset, dan akses ke teknologi.",
      "asal": "Berakar dari rumpun bahasa Jermanik (Inggris Kuno), berkembang di Kepulauan Inggris.",
      "fungsi": "Bahasa internasional untuk bisnis, akademik, dan teknologi.",
      "kekurangan": "Variasi aksen dan idiom dapat menyulitkan pemahaman di tingkat lanjut bagi non-native.",
      "kelebihan": "Sebagai lingua franca memiliki dokumentasi dan sumber belajar yang sangat luas.",
      "seberapaBanyakPengguna": "~1.5 miliar pengguna (L1 + L2, perkiraan)",
      "warna": "#0000FF",
      "kemampuan": ["Technical & Scientific Writing", "Presentasi Bisnis & Pitching", "Negosiasi Lintas Budaya", "Academic Research & Paper Writing", "Moderasi Diskusi", "Public Speaking"],
      "pengalaman": "Penggunaan aktif sebagai bahasa pengantar utama di lingkungan kerja multinasional selama 5+ tahun, termasuk rapat strategis, penulisan dokumen teknis, dan pelatihan internasional.",
      "sertifikasi": {
        "nama": "TOEFL PBT",
        "score": 610,
        "equivalent": "C1 CEFR"
      },
      "detailTambahan": {
        "kelebihan": "Kosakata teknis yang luas (khususnya di bidang IT dan bisnis), pengucapan (pronunciation) yang jelas.",
        "areaPengembangan": "Penggunaan idiom yang lebih niche dan aksen regional tertentu."
      }
    },
    {
      "nama": "Jawa",
      "tingkat": "Penutur Pasif (Intermediate)",
      "icon": "🎭",
      "level": 60,
      "deskripsi": "Memahami dengan baik percakapan sehari-hari dan budaya Jawa. Dapat berkomunikasi dalam konteks informal, namun memerlukan usaha lebih untuk berbicara secara aktif dan lancar.",
      "penjelasan": "Bahasa Jawa berguna dalam konteks budaya, adat, dan komunikasi keluarga; membantu berinteraksi pada acara tradisional dan memahami sastra lokal.",
      "tujuan": "Melestarikan komunikasi tradisional dan identitas budaya Jawa.",
      "manfaat": "Mempermudah interaksi dalam komunitas Jawa dan akses ke kebudayaan tradisional.",
      "asal": "Berasal dari pulau Jawa; bagian dari rumpun Austronesia.",
      "fungsi": "Digunakan dalam konteks sosial, adat, kesenian, dan percakapan keluarga.",
      "kekurangan": "Register (krama/ngoko) kompleks dan kurang digunakan dalam konteks formal modern di luar wilayah.",
      "kelebihan": "Kaya tradisi lisan dan sastra, ekspresif untuk konteks budaya.",
      "seberapaBanyakPengguna": "Puluhan juta penutur, terutama di Jawa, Indonesia",
      "warna": "#654321",
      "kemampuan": ["Percakapan Informal (Krama Madya & Ngoko)", "Memahami Ungkapan & Paribasan Tradisional", "Membaca Aksara Jawa Dasar (Hanacaraka)", "Menyimak Cerita Wayang"],
      "keterbatasan": "Kesulitan dengan kosakata teknis/modern, struktur kalimat Krama Inggil yang kompleks, dan menulis esai formal.",
      "detailTambahan": {
        "konteksPenggunaan": "Komunikasi dengan keluarga besar dan di lingkungan tradisional (seperti acara adat).",
        "aksara": "Kemampuan membaca-menulis aksara Jawa sekitar 70%"
      }
    },
    {
      "nama": "Japan",
      "tingkat": "Pemula (A1 - A2)",
      "icon": "🇯🇵",
      "level": 30,
      "deskripsi": "Berada di tahap fondasi. Mampu memahami dan menggunakan ekspresi sehari-hari yang sangat dasar dan frasa sederhana yang ditujukan untuk memenuhi kebutuhan konkret.",
      "penjelasan": "Bahasa Jepang (pemula) fokus pada penguasaan kana dan frasa dasar; bermanfaat untuk perjalanan, perkenalan, dan persiapan JLPT dasar.",
      "tujuan": "Mempelajari budaya, berkomunikasi saat bepergian, dan mempersiapkan sertifikasi seperti JLPT.",
      "manfaat": "Memudahkan perjalanan, interaksi dasar, dan akses ke konten/pekerjaan di Jepang.",
      "asal": "Berakar di Kepulauan Jepang; bahasa yang memiliki pengaruh Tiongkok historis.",
      "fungsi": "Komunikasi sehari-hari di Jepang, studi, dan akses ke media/pekerjaan lokal.",
      "kekurangan": "Sistem penulisan (kanji) menuntut waktu belajar signifikan.",
      "kelebihan": "Struktur sopan santun yang kaya dan kosa kata untuk konteks budaya spesifik.",
      "seberapaBanyakPengguna": "~125 juta penutur native (perkiraan populasi Jepang)",
      "warna": "#BC002D",
      "kemampuan": ["Membaca & Menulis Hiragana & Katakana", "Perkenalan Diri (Jikoshoukai)", "Percakapan Dasar (Memberi Salam, Bertanya Harga, Arah)", "Tata Bahasa Dasar (Pola ~masu, ~desu)"],
      "target": "Mencapai level N3 JLPT (Komunikasi Percakapan Sehari-hari) dalam 2 tahun ke depan.",
      "detailTambahan": {
        "kanjiDikuasai": "Sekitar 80 kanji dasar",
        "sumberBelajar": "Minna no Nihongo, Duolingo, Kelas Online",
        "fokusSekarang": "Memperbanyak kosakata (Vocabulary) dan pengenalan Kanji dasar."
      }
    }
  ],
  
  "bahasaPemrograman": [
    {
      "nama": "JavaScript",
      "tingkat": "Mahir",
      "icon": "⚡",
      "level": 90,
      "warna": "#F7DF1E",
      "framework": ["React", "Vue.js", "Node.js", "Express.js"],
      "tools": ["Webpack", "Vite", "Babel", "Jest", "Cypress", "ESLint", "Prettier"],
      "pengalaman": "4+ tahun pengembangan aplikasi enterprise skala penuh (full-stack). Memimpin arsitektur front-end untuk aplikasi dengan jutaan pengguna.",
      "penjelasan": "JavaScript adalah bahasa inti web untuk interaksi UI dan juga digunakan di server (Node.js); cocok untuk SPA, realtime, dan full-stack development.",
      "tujuan": "Membuat antarmuka web interaktif dan aplikasi server-side ringan.",
      "manfaat": "Interoperabilitas browser, ekosistem besar, dan kemampuan realtime.",
      "asal": "Dikembangkan oleh Brendan Eich di Netscape (1995).",
      "fungsi": "Membangun front-end interaktif, SPA, server-side dengan Node.js, dan scripting di berbagai platform.",
      "kekurangan": "Dynamic typing dapat menyebabkan bug runtime; ekosistem cepat berubah.",
      "kelebihan": "Ekosistem luas, banyak library, dijalankan langsung di browser.",
      "seberapaBanyakPengguna": "Dipakai hampir di seluruh situs web dan jutaan developer global.",
      "projectContoh": "Sistem Manajemen Inventari Real-time dengan WebSocket & IndexedDB",
      "detailTambahan": {
        "expertise": ["ES6+ Modern Syntax", "Async/Await & Promises", "Web Performance Optimization", "SPA & PWA Development"],
        "cicd": "GitHub Actions, Jenkins"
      }
    },
    {
      "nama": "Python",
      "tingkat": "Lanjutan",
      "icon": "🐍",
      "level": 85,
      "warna": "#3776AB",
      "framework": ["Django", "Flask", "FastAPI"],
      "libraries": ["Pandas", "NumPy", "Scikit-learn", "TensorFlow", "Matplotlib", "Requests", "BeautifulSoup"],
      "pengalaman": "3+ tahun dalam Data Analysis, Automation Scripting, dan Backend Development. Membangun dan mengoptimalkan pipeline data.",
      "penjelasan": "Python ideal untuk data analysis, scripting, dan prototyping ML; ekosistem library membuatnya cepat untuk membangun pipeline data dan model.",
      "tujuan": "Memproses data, membangun model ML, dan membuat prototipe aplikasi.",
      "manfaat": "Produktivitas tinggi, sintaks mudah dibaca, dan library ilmiah luas.",
      "asal": "Dikembangkan oleh Guido van Rossum pada awal 1990-an.",
      "fungsi": "Data analysis, automation, web backend, scripting, dan machine learning.",
      "kekurangan": "Tidak secepat bahasa terkompilasi untuk compute-intense tanpa optimisasi.",
      "kelebihan": "Ekosistem library yang kaya dan mudah dipelajari.",
      "seberapaBanyakPengguna": "Jutaan developer di akademia dan industri data.",
      "projectContoh": "Sistem Rekomendasi Produk E-commerce menggunakan Collaborative Filtering",
      "detailTambahan": {
        "expertise": ["REST API Development", "Data Wrangling & Visualization", "Basic Machine Learning Models", "Web Scraping"],
        "environment": "Jupyter Notebook, PyCharm, Virtualenv"
      }
    },
    {
      "nama": "Java",
      "tingkat": "Menengah-Atas",
      "icon": "☕",
      "level": 70,
      "warna": "#ED8B00",
      "framework": ["Spring Boot", "Spring MVC", "Hibernate/JPA"],
      "tools": ["Maven", "Gradle", "JUnit", "Mockito"],
      "pengalaman": "2 tahun pengembangan aplikasi Android native dan sistem backend enterprise untuk perbankan.",
      "penjelasan": "Java banyak dipakai di sistem enterprise dan Android; stabil untuk backend skala besar dan integrasi dengan database enterprise.",
      "tujuan": "Membangun sistem enterprise dan aplikasi mobile yang stabil.",
      "manfaat": "Portabilitas via JVM, tooling matang, dan dukungan enterprise.",
      "asal": "Dikembangkan oleh Sun Microsystems pada 1995.",
      "fungsi": "Backend enterprise, aplikasi Android (tradisional), dan sistem terdistribusi.",
      "kekurangan": "Verbosity/boilerplate lebih banyak dibandingkan bahasa modern.",
      "kelebihan": "Stabilitas, performa baik di JVM, dan dukungan luas di industri.",
      "seberapaBanyakPengguna": "Jutaan developer dan banyak perusahaan besar menggunakan Java.",
      "projectContoh": "Aplikasi Mobile Banking dengan fitur transfer, pembayaran, dan investasi",
      "detailTambahan": {
        "expertise": ["OOP Principles", "RESTful Services", "Basic Microservices", "Database Integration"],
        "areaPengembangan": "Spring Cloud, Reactive Programming"
      }
    },
    {
      "nama": "PHP",
      "tingkat": "Menengah-Atas",
      "icon": "🐘",
      "level": 75,
      "warna": "#777BB4",
      "framework": ["Laravel", "CodeIgniter"],
      "tools": ["Composer", "PHPUnit", "Xdebug"],
      "pengalaman": "Pengembangan dan maintenance CMS custom serta platform e-commerce dengan fokus pada keamanan dan performa.",
      "penjelasan": "PHP sering dipakai untuk website dan CMS; framework modern seperti Laravel menyederhanakan development web dan integrasi payment.",
      "tujuan": "Membuat situs web dinamis dan aplikasi server-side dengan cepat.",
      "manfaat": "Ekosistem CMS besar, hosting murah, dan deployment mudah.",
      "asal": "Dibuat oleh Rasmus Lerdorf pada 1994 sebagai bahasa scripting web.",
      "fungsi": "Server-side scripting untuk website dan CMS.",
      "kekurangan": "Banyak legacy codebase dengan praktik buruk; inkonsistensi sejarah syntax.",
      "kelebihan": "Mudah dipelajari, banyak hosting, dan ekosistem CMS besar.",
      "seberapaBanyakPengguna": "Jutaan situs dan developer menggunakan PHP di web.",
      "projectContoh": "Platform E-learning dengan fitur video streaming, kuis, dan sertifikasi",
      "detailTambahan": {
        "expertise": ["MVC Architecture", "Eloquent ORM", "API Integration", "Payment Gateway"],
        "database": "MySQL, Redis"
      }
    },
    {
      "nama": "SQL",
      "tingkat": "Lanjutan",
      "icon": "🗄️",
      "level": 80,
      "warna": "#4479A1",
      "variasi": ["MySQL", "PostgreSQL", "SQL Server", "SQLite"],
      "kemampuan": ["Query Optimization & Indexing", "Database Normalization & Design", "Stored Procedures & Functions", "Complex Joins & Subqueries", "Transaction Management"],
      "pengalaman": "Merancang, mengimplementasikan, dan memelihara skema database untuk aplikasi dengan data transaksional tinggi.",
      "penjelasan": "SQL digunakan untuk manipulasi dan query data relasional; penting untuk optimasi query, indexing, dan desain skema yang kuat.",
      "tujuan": "Menjaga integritas data dan menyediakan query efisien untuk aplikasi.",
      "manfaat": "Konsistensi data, kemampuan transaksi, dan optimasi performa query.",
      "asal": "Berasal dari konsep relational database yang diperkenalkan oleh E. F. Codd.",
      "fungsi": "Menyimpan dan meng-query data relasional untuk aplikasi.",
      "kekurangan": "Kurang cocok untuk data sangat tidak terstruktur tanpa desain tambahan.",
      "kelebihan": "Kekuatan dalam transaksi, konsistensi, dan optimasi query.",
      "seberapaBanyakPengguna": "Digunakan luas oleh perusahaan dan aplikasi (jutaan database terpasang).",
      "detailTambahan": {
        "tools": ["phpMyAdmin", "pgAdmin", "HeidiSQL"],
        "expertise": ["Membangun ETL Pipeline Sederhana", "Pemahaman Mendalam tentang ACID Properties"]
      }
    },
    {
      "nama": "React",
      "tingkat": "Mahir",
      "icon": "⚛️",
      "level": 88,
      "warna": "#61DAFB",
      "ecosystem": ["Redux & Redux Toolkit", "React Router", "Styled-Components", "React Query", "Formik"],
      "tools": ["Next.js", "React Testing Library", "Storybook"],
      "pengalaman": "Membangun dan memimpin pengembangan 10+ aplikasi React production-ready, dari konsep hingga deployment dan maintenance.",
      "penjelasan": "React adalah library UI populer untuk membangun antarmuka interaktif; cocok untuk SPA dan komposisi komponen yang reusable.",
      "tujuan": "Menyusun antarmuka berbasis komponen yang dapat di-reuse dan di-maintain.",
      "manfaat": "Produktivitas developer, performa UI, dan ekosistem komponenisasi.",
      "asal": "Dikembangkan oleh Facebook (Meta) dan diperkenalkan secara luas pada 2013.",
      "fungsi": "Membangun UI untuk web dan mobile (React Native).",
      "kekurangan": "Sering memerlukan tooling tambahan dan kurva belajar untuk state management pada skala besar.",
      "kelebihan": "Komunitas besar, ekosistem mature, dan pola komponen yang kuat.",
      "seberapaBanyakPengguna": "Jutaan developer dan perusahaan menggunakan React untuk frontend",
      "keahlianKhusus": ["Advanced State Management", "Performance Optimization (Memo, useCallback)", "Custom Hooks", "Component Composition & Design Patterns", "SSR/SSG dengan Next.js"],
      "detailTambahan": {
        "testing": "Unit Test, Integration Test, End-to-End Test",
        "architecture": "Feature-Based Structure, Atomic Design"
      }
    },
    {
      "nama": "Go",
      "tingkat": "Lanjutan",
      "icon": "🐹",
      "level": 82,
      "warna": "#00ADD8",
      "framework": ["Gin", "Echo", "Fiber"],
      "tools": ["Go Modules", "Testify", "Viper", "Cobra"],
      "pengalaman": "2+ tahun pengembangan microservices dan CLI tools untuk sistem distributed. Optimasi performa high-throughput aplikasi backend.",
      "penjelasan": "Go dirancang untuk concurrency dan performa; cocok untuk microservices dan network tools yang membutuhkan throughput tinggi.",
      "tujuan": "Membangun layanan network dan microservices efisien.",
      "manfaat": "Binary kecil, mudah di-deploy, dan model concurrency sederhana.",
      "asal": "Dikembangkan oleh Google (Robert Griesemer, Rob Pike, Ken Thompson) pada 2007.",
      "fungsi": "Backend services, CLI tools, dan network applications.",
      "kekurangan": "Kurang fitur bahasa canggih dibanding Rust; beberapa fitur abstraksi terbatas.",
      "kelebihan": "Sederhana, cepat, dan cocok untuk deployment microservices.",
      "seberapaBanyakPengguna": "Populer di kalangan backend dan infrastruktur; banyak proyek open-source menggunakan Go",
      "projectContoh": "API Gateway dengan load balancing dan rate limiting untuk 10k+ RPS",
      "detailTambahan": {
        "expertise": ["Concurrency Patterns", "Memory Optimization", "Cross-Compilation", "GRPC Protobuf"],
        "deployment": "Docker, Kubernetes, AWS ECS"
      }
    },
    {
      "nama": "Rust",
      "tingkat": "Menengah",
      "icon": "🦀",
      "level": 68,
      "warna": "#DEA584",
      "framework": ["Actix-web", "Rocket", "Tokio"],
      "libraries": ["Serde", "Tokio", "Reqwest", "Clap"],
      "pengalaman": "Pengembangan sistem performa kritis dan WebAssembly. Membuat parser custom dan tools sistem dengan memory safety.",
      "penjelasan": "Rust menekankan keamanan memori dan performa; ideal untuk sistem-level programming, high-performance tools, dan WebAssembly.",
      "tujuan": "Membangun software yang aman memori dan ber-performa tinggi.",
      "manfaat": "Mengurangi bug terkait memori dan memberikan performa mendekati C/C++.",
      "asal": "Dikembangkan oleh Mozilla Research (Graydon Hoare) dan komunitas sejak 2010.",
      "fungsi": "System programming, CLI tools, dan komponen performa kritis.",
      "kekurangan": "Curam untuk dipelajari (ownership, lifetimes).",
      "kelebihan": "Keamanan memori tanpa garbage collector dan performa tinggi.",
      "seberapaBanyakPengguna": "Berkembang pesat; banyak tooling dan proyek sistem mengadopsi Rust",
      "projectContoh": "Real-time Data Processing Engine dengan zero-copy parsing",
      "detailTambahan": {
        "expertise": ["Ownership System", "Fearless Concurrency", "WebAssembly Compilation", "FFI Binding"],
        "toolchain": "Cargo, Rustup, WASM-Pack"
      }
    },
    {
      "nama": "Kotlin",
      "tingkat": "Lanjutan",
      "icon": "🅱️",
      "level": 78,
      "warna": "#7F52FF",
      "framework": ["Spring Boot", "Ktor", "Compose Multiplatform"],
      "tools": ["Gradle", "Dokka", "Detekt"],
      "pengalaman": "Pengembangan aplikasi Android native dan backend sistem payment. Migrasi codebase Java ke Kotlin dengan coroutines.",
      "penjelasan": "Kotlin modern menggantikan banyak kebutuhan Java di Android; mendukung coroutines untuk concurrency yang lebih sederhana.",
      "tujuan": "Meningkatkan produktivitas pengembangan Android dan server-side.",
      "manfaat": "Null-safety, interoperabilitas dengan Java, dan coroutines untuk concurrency.",
      "asal": "Dikembangkan oleh JetBrains dan dirilis pada 2011.",
      "fungsi": "Pengembangan Android, server-side, dan multiplatform.",
      "kekurangan": "Masih terdapat edge-case tooling dibanding Java pada beberapa ekosistem besar.",
      "kelebihan": "Sintaks modern, pengurangan boilerplate, interoperabilitas Java.",
      "seberapaBanyakPengguna": "Populer di Android dan backend; jutaan aplikasi menggunakan Kotlin",
      "projectContoh": "Aplikasi Fintech dengan coroutines flow dan biometric authentication",
      "detailTambahan": {
        "expertise": ["Coroutines & Flow", "Null Safety", "Extension Functions", "DSL Building"],
        "platform": "Android, JVM, Server-side"
      }
    },
    {
      "nama": "Dart",
      "tingkat": "Lanjutan",
      "icon": "🎯",
      "level": 79,
      "warna": "#0175C2",
      "framework": ["Flutter", "AngularDart"],
      "tools": ["Flutter SDK", "Dart DevTools", "Firebase"],
      "pengalaman": "2+ tahun pengembangan aplikasi cross-platform untuk mobile dan web. Membangun aplikasi dengan smooth animation dan responsive design.",
      "penjelasan": "Dart (bersama Flutter) memudahkan pembuatan UI cross-platform berkinerja tinggi dengan satu codebase; cocok untuk aplikasi mobile interaktif.",
      "tujuan": "Membangun aplikasi mobile/web cross-platform dengan UI konsisten.",
      "manfaat": "Hot-reload, performa native-like, dan pengembangan UI cepat.",
      "asal": "Dikembangkan oleh Google dan populer bersama Flutter sejak 2017+.",
      "fungsi": "UI development untuk mobile/web via Flutter.",
      "kekurangan": "Ekosistem paket belum seluas ekosistem native tertentu.",
      "kelebihan": "Satu codebase untuk banyak platform dan performa baik.",
      "seberapaBanyakPengguna": "Berkembang cepat; banyak startup memilih Flutter/Dart",
      "projectContoh": "Aplikasi E-commerce dengan real-time chat dan push notification",
      "detailTambahan": {
        "expertise": ["Widget Composition", "State Management", "Platform Channels", "Custom Painters"],
        "deployment": "Google Play Store, Apple App Store, Web"
      }
    },
    {
      "nama": "Swift",
      "tingkat": "Menengah-Atas",
      "icon": "🐦",
      "level": 72,
      "warna": "#F05138",
      "framework": ["SwiftUI", "UIKit", "Vapor"],
      "tools": ["Xcode", "Swift Package Manager", "CocoaPods"],
      "pengalaman": "Pengembangan aplikasi iOS native dan prototyping macOS apps. Integrasi dengan Apple ecosystem dan services.",
      "penjelasan": "Swift adalah bahasa utama iOS/macOS modern; memberikan performa dan fitur bahasa modern untuk aplikasi Apple ecosystem.",
      "tujuan": "Membangun aplikasi iOS/macOS modern yang aman dan performa tinggi.",
      "manfaat": "Performa, sintaks modern, dan integrasi resmi Apple.",
      "asal": "Dikembangkan oleh Apple dan dirilis pada 2014.",
      "fungsi": "Aplikasi iOS, macOS, dan layanan client-side yang terintegrasi Apple.",
      "kekurangan": "Terikat erat pada ekosistem Apple; porting ke non-Apple sulit.",
      "kelebihan": "Performa baik dan dukungan tooling resmi Apple.",
      "seberapaBanyakPengguna": "Banyak di kalangan pengembang iOS/macOS",
      "projectContoh": "Aplikasi Health & Fitness tracker dengan HealthKit integration",
      "detailTambahan": {
        "expertise": ["MVVM Architecture", "Combine Framework", "Core Data", "ARKit Basics"],
        "platform": "iOS, iPadOS, macOS"
      }
    },
    {
      "nama": "C#",
      "tingkat": "Lanjutan",
      "icon": "🔷",
      "level": 81,
      "warna": "#239120",
      "framework": [".NET Core", "ASP.NET MVC", "Entity Framework", "Xamarin"],
      "tools": ["Visual Studio", "NuGet", "MSBuild"],
      "pengalaman": "3+ tahun pengembangan enterprise applications untuk financial services dan gaming industry.",
      "penjelasan": "C# kuat di ekosistem .NET untuk aplikasi enterprise dan game development; cocok untuk backend, desktop, dan Unity game.",
      "tujuan": "Membangun aplikasi enterprise, backend, dan game menggunakan .NET dan Unity.",
      "manfaat": "Tooling Visual Studio lengkap, ekosistem .NET matang, dan dukungan cross-platform (.NET Core).",
      "asal": "Dikembangkan oleh Microsoft (Anders Hejlsberg) pada awal 2000-an.",
      "fungsi": "Backend, desktop apps, game development, dan layanan cloud.",
      "kekurangan": "Terkadang lebih terikat pada ekosistem Microsoft meskipun .NET kini cross-platform.",
      "kelebihan": "Tooling matang, performa, dan ekosistem enterprise.",
      "seberapaBanyakPengguna": "Banyak di perusahaan enterprise dan industri game (Unity).",
      "projectContoh": "Sistem Trading Platform dengan real-time market data processing",
      "detailTambahan": {
        "expertise": ["LINQ", "Async Programming", "Dependency Injection", "Windows Services"],
        "specialization": "Game Development dengan Unity"
      }
    },
    {
      "nama": "Ruby",
      "tingkat": "Menengah",
      "icon": "💎",
      "level": 65,
      "warna": "#CC342D",
      "framework": ["Ruby on Rails", "Sinatra"],
      "tools": ["Bundler", "Rake", "RSpec"],
      "pengalaman": "Pengembangan web applications dan automation scripts. Fokus pada clean code dan developer productivity.",
      "penjelasan": "Ruby, terutama dengan Rails, mempercepat pengembangan web berkat konvensi dan produktivitas developer untuk MVP.",
      "tujuan": "Membangun aplikasi web dengan cepat untuk MVP dan startup.",
      "manfaat": "Produktivitas tinggi, konvensi-over-konfigurasi mempercepat development.",
      "asal": "Dikembangkan oleh Yukihiro Matsumoto (Matz) di Jepang pada 1990-an.",
      "fungsi": "Aplikasi web, prototyping, scripting.",
      "kekurangan": "Performa di skala besar kadang kalah dibanding bahasa tertentu.",
      "kelebihan": "Produktivitas developer dan ekosistem gems.",
      "seberapaBanyakPengguna": "Masih populer di startup dan komunitas web (puluhan- ratusan ribu aplikasi).",
      "projectContoh": "SaaS Platform untuk project management dengan subscription billing",
      "detailTambahan": {
        "expertise": ["Metaprogramming", "Block & Procs", "RESTful APIs", "MVC Pattern"],
        "testing": "RSpec, Capybara, Factory Bot"
      }
    },
    {
      "nama": "Kubernetes",
      "tingkat": "Menengah-Atas",
      "icon": "⚓",
      "level": 76,
      "warna": "#326CE5",
      "concepts": ["Pods", "Services", "Deployments", "StatefulSets", "Ingress"],
      "tools": ["kubectl", "Helm", "k9s", "Lens"],
      "pengalaman": "Deployment dan management containerized applications pada production environment. Setup cluster dan monitoring.",
      "penjelasan": "Kubernetes adalah platform orkestrasi container untuk menjalankan aplikasi terdistribusi dengan autoscaling, rolling updates, dan service discovery.",
      "tujuan": "Mengorkestrasi container pada skala besar dengan resiliency dan autoscaling.",
      "manfaat": "Manajemen layanan, autoscaling, rolling updates, dan deklaratif infrastructure.",
      "asal": "Dikembangkan oleh Google berdasarkan pengalaman Borg dan diserahkan ke CNCF.",
      "fungsi": "Orkestrasi container, service discovery, dan manajemen lifecycle aplikasi.",
      "kekurangan": "Kompleksitas operasional dan learning curve tinggi untuk tim kecil.",
      "kelebihan": "Skalabilitas dan de-facto standard untuk orkestrasi container.",
      "seberapaBanyakPengguna": "Digunakan luas di industri oleh ribuan organisasi.",
      "projectContoh": "Multi-tier web application dengan auto-scaling dan service mesh",
      "detailTambahan": {
        "expertise": ["Cluster Networking", "Storage Management", "Security Policies", "Resource Optimization"],
        "environment": "AWS EKS, Google GKE, On-premise"
      }
    },
    {
      "nama": "Docker",
      "tingkat": "Mahir",
      "icon": "🐳",
      "level": 87,
      "warna": "#2496ED",
      "components": ["Dockerfile", "Docker Compose", "Docker Swarm", "Docker Registry"],
      "tools": ["Docker CLI", "Docker Desktop", "Portainer"],
      "pengalaman": "4+ tahun containerization applications dari development sampai production. Optimasi image size dan security.",
      "penjelasan": "Docker mempermudah pembuatan, distribusi, dan jalannya aplikasi terisolasi; sangat berguna untuk development dan deployment konsisten.",
      "tujuan": "Membuat lingkungan aplikasi yang konsisten antara development dan production.",
      "manfaat": "Isolasi lingkungan, reproducibility, dan memudahkan deployment.",
      "asal": "Dikembangkan oleh Docker, Inc. (awalnya dotCloud) pada 2013.",
      "fungsi": "Membuat dan menjalankan container, image management, dan deployment.",
      "kekurangan": "Overhead pengelolaan storage dan security jika tidak dikonfigurasi dengan benar.",
      "kelebihan": "Mempermudah reproduksi environment dan CI/CD.",
      "seberapaBanyakPengguna": "Sangat luas; banyak tim development dan operasi memakai Docker.",
      "projectContoh": "Microservices architecture dengan 50+ containers pada production cluster",
      "detailTambahan": {
        "expertise": ["Multi-stage Builds", "Volume Management", "Network Configuration", "Security Scanning"],
        "bestPractices": "Minimal Images, Non-root Users, Image Layering"
      }
    },
    {
      "nama": "TensorFlow",
      "tingkat": "Menengah",
      "icon": "🧠",
      "level": 69,
      "warna": "#FF6F00",
      "libraries": ["Keras", "TensorFlow.js", "TF Lite"],
      "tools": ["TensorBoard", "Colab", "Jupyter"],
      "pengalaman": "Pengembangan machine learning models untuk computer vision dan natural language processing.",
      "penjelasan": "TensorFlow adalah framework ML untuk membangun, melatih, dan men-deploy model; cocok untuk research dan production ML workflows.",
      "tujuan": "Membangun dan men-deploy model machine learning untuk berbagai use-case.",
      "manfaat": "Tooling lengkap untuk training, visualisasi (TensorBoard), dan deployment model.",
      "asal": "Dikembangkan oleh Google Brain dan komunitas open-source.",
      "fungsi": "Research ML, training model, dan deployment di production.",
      "kekurangan": "Steep learning curve untuk API lanjutan dan model kompleks.",
      "kelebihan": "Skalabilitas dan tooling ekosistem yang kuat.",
      "seberapaBanyakPengguna": "Banyak di industri dan riset ML; digunakan oleh perusahaan besar.",
      "projectContoh": "Image classification system untuk quality control manufacturing",
      "detailTambahan": {
        "expertise": ["Neural Networks", "Transfer Learning", "Model Optimization", "Data Pipeline"],
        "deployment": "TensorFlow Serving, Mobile Deployment, Web Deployment"
      }
    },
    {
      "nama": "React Native",
      "tingkat": "Lanjutan",
      "icon": "⚛️",
      "level": 84,
      "warna": "#61DAFB",
      "framework": ["Expo", "React Navigation"],
      "libraries": ["Redux", "Axios", "React Query", "Native Base"],
      "pengalaman": "3+ tahun membangun mobile apps untuk iOS dan Android dari single codebase. Performance optimization.",
      "penjelasan": "React Native memungkinkan pengembangan mobile cross-platform menggunakan skill React; mempermudah reuse kode antara web dan mobile.",
      "tujuan": "Membangun aplikasi mobile cross-platform dengan basis React.",
      "manfaat": "Reuse code antara web dan mobile, pengembangan lebih cepat.",
      "asal": "Dikembangkan oleh Facebook (Meta) untuk membawa React ke mobile.",
      "fungsi": "Pengembangan aplikasi iOS dan Android menggunakan JavaScript/React.",
      "kekurangan": "Performa native kadang memerlukan native modules untuk optimasi.",
      "kelebihan": "Kecepatan pengembangan dan basis komunitas React.",
      "seberapaBanyakPengguna": "Banyak startup dan perusahaan memakai React Native untuk mobile apps.",
      "projectContoh": "Social Media App dengan video streaming dan real-time interactions",
      "detailTambahan": {
        "expertise": ["Cross-platform Development", "Native Modules", "Performance Tuning", "Offline First"],
        "architecture": "Component-driven, Hooks Pattern, Context API"
      }
    },
    {
      "nama": "GraphQL",
      "tingkat": "Lanjutan",
      "icon": "📊",
      "level": 80,
      "warna": "#E10098",
      "tools": ["Apollo Server", "Apollo Client", "GraphQL Yoga", "Hasura"],
      "libraries": ["Relay", "Urql", "GraphQL Code Generator"],
      "pengalaman": "Implementasi GraphQL APIs untuk complex data requirements dan mobile clients.",
      "penjelasan": "GraphQL memberi kontrol penuh ke klien atas data yang diminta; cocok untuk API yang melayani beragam klien dengan kebutuhan data berbeda.",
      "tujuan": "Memberikan API fleksibel yang memungkinkan klien meminta data persis yang dibutuhkan.",
      "manfaat": "Mengurangi overfetching/underfetching, cocok untuk mobile dan SPA.",
      "asal": "Dikembangkan oleh Facebook dan kemudian open-sourced.",
      "fungsi": "Query language untuk API yang memungkinkan agregasi data dari berbagai sumber.",
      "kekurangan": "Desain schema dan caching lebih kompleks dibanding REST tradisional.",
      "kelebihan": "Fleksibilitas query dan efisiensi data pada klien.",
      "seberapaBanyakPengguna": "Banyak digunakan di startup dan perusahaan yang memerlukan API fleksibel.",
      "projectContoh": "Unified API Gateway untuk aggregate multiple backend services",
      "detailTambahan": {
        "expertise": ["Schema Design", "Query Optimization", "Caching Strategies", "Error Handling"],
        "security": "Authentication, Authorization, Query Depth Limiting"
      }
    },
    {
      "nama": "Elixir",
      "tingkat": "Menengah",
      "icon": "🧪",
      "level": 67,
      "warna": "#4B275F",
      "framework": ["Phoenix", "Plug", "Ecto"],
      "tools": ["Mix", "Hex", "IEx"],
      "pengalaman": "Pengembangan high-concurrency applications dan real-time features. Functional programming paradigm.",
      "penjelasan": "Elixir (dengan Phoenix) unggul untuk aplikasi real-time dan concurrent berkat arsitektur OTP dan BEAM VM.",
      "tujuan": "Membangun aplikasi real-time dan highly concurrent.",
      "manfaat": "Performa concurrency tinggi dan fault tolerance.",
      "asal": "Dikembangkan oleh José Valim dan komunitas sebagai bahasa berbasis BEAM.",
      "fungsi": "Aplikasi real-time, chat, dan layanan concurrent.",
      "kekurangan": "Kurva belajar paradigma functional dan OTP untuk developer imperatif.",
      "kelebihan": "Fault-tolerance dan skalabilitas untuk aplikasi real-time.",
      "seberapaBanyakPengguna": "Populer di aplikasi real-time; komunitas berkembang cepat.",
      "projectContoh": "Real-time collaboration tool dengan presence tracking dan live updates",
      "detailTambahan": {
        "expertise": ["OTP Principles", "Process Supervision", "Pattern Matching", "Pipe Operator"],
        "strengths": "Fault Tolerance, Scalability, Maintainability"
      }
    },
    {
      "nama": "Vue.js",
      "tingkat": "Mahir",
      "icon": "🟢",
      "level": 89,
      "warna": "#4FC08D",
      "ecosystem": ["Vuex", "Vue Router", "Vue CLI", "Vite"],
      "tools": ["Vue DevTools", "Vue Test Utils", "Storybook"],
      "pengalaman": "4+ tahun membangun large-scale SPA dan enterprise applications. Vue 2 dan 3 migration experience.",
      "penjelasan": "Vue.js adalah framework progresif yang memudahkan pembangunan UI reaktif; cocok untuk tim kecil hingga besar dan migrasi bertahap.",
      "tujuan": "Menyediakan cara mudah membangun UI reaktif dan modular.",
      "manfaat": "Fleksibilitas adopsi bertahap, kurva belajar ramah, dan reactivity system yang kuat.",
      "asal": "Dikembangkan oleh Evan You dan komunitas open-source.",
      "fungsi": "Membangun SPA dan UI reaktif yang modular.",
      "kekurangan": "Ecosystem bervariasi antara versi 2 dan 3 untuk beberapa library.",
      "kelebihan": "Ringan, mudah dipelajari, dan cocok untuk migrasi bertahap.",
      "seberapaBanyakPengguna": "Banyak digunakan di perusahaan dan projek SPA di seluruh dunia.",
      "projectContoh": "Admin Dashboard dengan real-time analytics dan modular component system",
      "detailTambahan": {
        "expertise": ["Composition API", "Reactivity System", "Custom Directives", "Plugin Development"],
        "patterns": "Atomic Design, Renderless Components, Scoped Slots"
      }
    },
    {
      "nama": "MongoDB",
      "tingkat": "Lanjutan",
      "icon": "🍃",
      "level": 78,
      "warna": "#47A248",
      "operations": ["Aggregation", "Indexing", "Transactions", "Replication"],
      "tools": ["MongoDB Compass", "MongoDB Atlas", "Mongo Shell"],
      "pengalaman": "Design dan optimization database schema untuk unstructured data dan high-write workloads.",
      "penjelasan": "MongoDB sesuai untuk data semi-terstruktur dan workloads berkecepatan tinggi; menawarkan fleksibilitas skema dan agregasi kuat.",
      "tujuan": "Menyimpan data semi-terstruktur dengan fleksibilitas skema.",
      "manfaat": "Skema fleksibel, agregasi kuat, dan skalabilitas horizontal.",
      "asal": "Dikembangkan oleh MongoDB, Inc. sebagai database dokumen NoSQL.",
      "fungsi": "Data store untuk aplikasi yang membutuhkan skema fleksibel dan write-heavy workloads.",
      "kekurangan": "Tidak cocok untuk transaksi relasional kompleks tanpa desain tambahan.",
      "kelebihan": "Fleksibilitas skema dan performa untuk use-case tertentu.",
      "seberapaBanyakPengguna": "Banyak di startup dan aplikasi modern yang memerlukan fleksibilitas skema.",
      "projectContoh": "IoT Platform handling 1M+ sensor readings per day",
      "detailTambahan": {
        "expertise": ["Data Modeling", "Query Performance", "Sharding Strategies", "Backup Recovery"],
        "useCases": "Content Management, Catalogs, Real-time Analytics"
      }
    },
    {
      "nama": "Redis",
      "tingkat": "Menengah-Atas",
      "icon": "🔴",
      "level": 74,
      "warna": "#DC382D",
      "useCases": ["Caching", "Session Storage", "Message Broker", "Real-time Features"],
      "tools": ["Redis CLI", "Redis Insight", "Redis-Benchmark"],
      "pengalaman": "Implementasi caching layer dan real-time features untuk high-traffic web applications.",
      "penjelasan": "Redis ideal sebagai cache, message broker, dan data store in-memory; meningkatkan latensi dan throughput aplikasi.",
      "tujuan": "Memberikan storage in-memory cepat untuk caching dan pub/sub.",
      "manfaat": "Menurunkan latensi dan meningkatkan throughput aplikasi.",
      "asal": "Dikembangkan oleh Salvatore Sanfilippo (antirez).",
      "fungsi": "Cache, session store, message broker, dan struktur data in-memory.",
      "kekurangan": "Data in-memory rentan jika tidak dipersist atau direplikasi dengan benar.",
      "kelebihan": "Sangat cepat untuk operasi in-memory dan cocok untuk real-time features.",
      "seberapaBanyakPengguna": "Banyak dipakai sebagai caching layer dan message broker di industri.",
      "projectContoh": "Distributed cache system mengurangi database load hingga 70%",
      "detailTambahan": {
        "expertise": ["Data Structures", "Memory Optimization", "Persistence", "Cluster Management"],
        "patterns": "Cache-Aside, Write-Through, Pub/Sub, Leaderboard"
      }
    },
    {
      "nama": "AWS",
      "tingkat": "Lanjutan",
      "icon": "☁️",
      "level": 83,
      "warna": "#FF9900",
      "services": ["EC2", "S3", "Lambda", "RDS", "DynamoDB", "CloudFront"],
      "tools": ["AWS CLI", "CloudFormation", "AWS SDK"],
      "pengalaman": "3+ tahun design dan deployment cloud infrastructure untuk startups dan enterprises.",
      "penjelasan": "AWS menyediakan layanan cloud komprehensif untuk compute, storage, dan serverless; berguna untuk deployment skala besar.",
      "tujuan": "Menyediakan infrastruktur cloud untuk menjalankan aplikasi dan layanan skala besar.",
      "manfaat": "Layanan terkelola, global footprint, dan banyak pilihan layanan cloud.",
      "asal": "Dikembangkan oleh Amazon Web Services (AWS).",
      "fungsi": "Compute, storage, database, serverless, dan layanan cloud lainnya.",
      "kekurangan": "Model biaya bisa kompleks dan memerlukan optimasi untuk cost-efficiency.",
      "kelebihan": "Skala global dan banyak layanan terintegrasi.",
      "seberapaBanyakPengguna": "Banyak organisasi dan startup di seluruh dunia menggunakan AWS.",
      "projectContoh": "Serverless e-commerce platform dengan auto-scaling dan global CDN",
      "detailTambahan": {
        "expertise": ["Infrastructure as Code", "Cost Optimization", "Security Groups", "Disaster Recovery"],
        "certifications": "AWS Solutions Architect Associate"
      }
    },
    {
      "nama": "Git",
      "tingkat": "Mahir",
      "icon": "📚",
      "level": 92,
      "warna": "#F05032",
      "workflows": ["GitFlow", "Feature Branch", "Forking", "Trunk-based"],
      "tools": ["Git CLI", "GitHub", "GitLab", "SourceTree"],
      "pengalaman": "5+ tahun version control management untuk teams dari 5 hingga 50 developers.",
      "penjelasan": "Git adalah sistem version control distributed yang esensial untuk kolaborasi tim, branching, dan CI/CD modern.",
      "tujuan": "Memfasilitasi version control dan kolaborasi code secara terdistribusi.",
      "manfaat": "Branching strategi, history tracking, dan integrasi CI/CD.",
      "asal": "Dikembangkan oleh Linus Torvalds (awal) sebagai sistem VCS terdistribusi.",
      "fungsi": "Version control untuk kode sumber dan kolaborasi tim.",
      "kekurangan": "Konsep rebase/merge bisa membingungkan untuk pemula.",
      "kelebihan": "Sangat fleksibel dan menjadi standar de-facto untuk VCS.",
      "seberapaBanyakPengguna": "Digunakan hampir di seluruh proyek perangkat lunak modern (juta+ repos).",
      "projectContoh": "Mentoring team migration dari SVN ke Git dengan customized workflow",
      "detailTambahan": {
        "expertise": ["Branching Strategies", "Merge Conflicts", "Rebase vs Merge", "Hooks Scripting"],
        "advanced": "Interactive Rebase, Cherry-picking, Submodules, Bisect"
      }
    },
    {
      "nama": "SASS/SCSS",
      "tingkat": "Mahir",
      "icon": "🎨",
      "level": 88,
      "warna": "#CF649A",
      "features": ["Variables", "Mixins", "Functions", "Nesting", "Modules"],
      "tools": ["Dart Sass", "Node Sass", "Webpack Loader"],
      "pengalaman": "4+ tahun maintainable CSS architecture dan design systems untuk large codebases.",
      "penjelasan": "SASS/SCSS menambah fitur pada CSS seperti variabel dan mixins; membantu menjaga konsistensi styling di project besar.",
      "tujuan": "Memperluas kemampuan CSS dengan variabel, mixins, dan modularisasi.",
      "manfaat": "Memudahkan maintenance styling dan pengelompokan tema/variable global.",
      "asal": "Sass dikembangkan awalnya oleh Hampton Catlin dan Nathan Weizenbaum; SCSS adalah sintaks yang lebih CSS-like.",
      "fungsi": "Preprocessor CSS untuk meningkatkan kemampuan styling dan struktur codebase.",
      "kekurangan": "Perlu build step tambahan dan konvensi struktural untuk scale.",
      "kelebihan": "Variabel, mixins, dan nesting membuat styling terstruktur dan DRY.",
      "seberapaBanyakPengguna": "Banyak proyek frontend enterprise memakai SASS/SCSS.",
      "projectContoh": "Enterprise Design System dengan theming dan accessibility compliance",
      "detailTambahan": {
        "expertise": ["BEM Methodology", "Responsive Mixins", "Color Functions", "Utility Classes"],
        "architecture": "7-1 Pattern, ITCSS, Component-based Styling"
      }
    },
    {
      "nama": "Jest",
      "tingkat": "Lanjutan",
      "icon": "🃏",
      "level": 82,
      "warna": "#99425B",
      "features": ["Unit Testing", "Integration Testing", "Snapshot Testing", "Mocking"],
      "tools": ["Jest CLI", "Jest Runner", "Coverage Reports"],
      "pengalaman": "Comprehensive testing strategy untuk JavaScript/TypeScript projects dari unit sampai integration.",
      "penjelasan": "Jest adalah framework testing yang sederhana dan powerful untuk JS/TS; mendukung mocking, snapshot, dan coverage laporan.",
      "tujuan": "Memudahkan penulisan unit dan integration tests untuk JS/TS.",
      "manfaat": "Mocking, snapshot tests, dan integrated coverage untuk menjaga kualitas kode.",
      "asal": "Dikembangkan oleh Facebook (Meta) untuk ekosistem JavaScript.",
      "fungsi": "Framework testing untuk unit, integration, dan snapshot tests.",
      "kekurangan": "Konfigurasi lanjutan untuk environment non-standard bisa rumit.",
      "kelebihan": "Setup mudah, integrasi kuat dengan ekosistem React/JS.",
      "seberapaBanyakPengguna": "Digunakan luas di projek JS/TS modern untuk testing.",
      "projectContoh": "Test suite untuk financial calculator dengan 95%+ code coverage",
      "detailTambahan": {
        "expertise": ["Async Testing", "Mock Functions", "Custom Matchers", "Setup/Teardown"],
        "integration": "React Testing, Vue Test Utils, Enzyme"
      }
    },
    {
      "nama": "Webpack",
      "tingkat": "Lanjutan",
      "icon": "📦",
      "level": 79,
      "warna": "#8DD6F9",
      "concepts": ["Entry/Output", "Loaders", "Plugins", "Code Splitting"],
      "tools": ["webpack-cli", "webpack-dev-server", "Bundle Analyzer"],
      "pengalaman": "Optimization build process untuk large-scale applications dengan complex dependency graphs.",
      "penjelasan": "Webpack mengelola bundling dan optimisasi aset frontend; memungkinkan code splitting dan loader khusus untuk berbagai asset.",
      "tujuan": "Mengemas asset frontend menjadi bundle yang optimal untuk production.",
      "manfaat": "Code splitting, tree shaking, dan plugin untuk optimisasi bundle.",
      "asal": "Dikembangkan oleh Tobias Koppers (sudah lama menjadi standar bundler JS).",
      "fungsi": "Bundling asset frontend dan optimisasi build.",
      "kekurangan": "Konfigurasi custom yang kompleks bisa sulit dipahami.",
      "kelebihan": "Sangat fleksibel dengan banyak plugin dan loader.",
      "seberapaBanyakPengguna": "Banyak project legacy dan modern masih menggunakan Webpack.",
      "projectContoh": "Custom webpack configuration mengurangi bundle size hingga 40%",
      "detailTambahan": {
        "expertise": ["Performance Optimization", "Tree Shaking", "Hot Module Replacement", "Asset Management"],
        "advanced": "Custom Loaders, Plugin Development, Multiple Configs"
      }
    },
    {
      "nama": "Figma",
      "tingkat": "Lanjutan",
      "icon": "🎯",
      "level": 77,
      "warna": "#F24E1E",
      "features": ["Components", "Auto Layout", "Prototyping", "Design Systems"],
      "tools": ["Figma Plugins", "Figma API", "Dev Mode"],
      "pengalaman": "Collaborative UI/UX design dan handoff to development teams. Design system management.",
      "penjelasan": "Figma adalah tools desain kolaboratif untuk UI/UX; memudahkan prototyping, design tokens, dan handoff ke pengembang.",
      "tujuan": "Memfasilitasi desain UI/UX kolaboratif dan prototyping.",
      "manfaat": "Kolaborasi real-time, design system management, dan handoff ke developer.",
      "asal": "Dikembangkan oleh Figma, Inc. sebagai tool desain berbasis web.",
      "fungsi": "Desain UI/UX, prototyping, dan dokumentasi desain.",
      "kekurangan": "Fitur offline terbatas dibanding aplikasi native tertentu.",
      "kelebihan": "Kolaborasi real-time dan integrasi design-system yang kuat.",
      "seberapaBanyakPengguna": "Banyak desainer dan tim produk menggunakan Figma.",
      "projectContoh": "Enterprise design system dengan comprehensive component library",
      "detailTambahan": {
        "expertise": ["Design Tokens", "Variants", "Interactive Prototypes", "Developer Handoff"],
        "workflow": "Component-driven Design, Version Control, Team Libraries"
      }
    },
    {
      "nama": "Cybersecurity",
      "tingkat": "Menengah",
      "icon": "🛡️",
      "level": 71,
      "warna": "#3949AB",
      "domains": ["Web Security", "Network Security", "Application Security"],
      "tools": ["Burp Suite", "Nmap", "OWASP ZAP", "Metasploit"],
      "pengalaman": "Security assessment dan penetration testing untuk web applications dan network infrastructure.",
      "penjelasan": "Cybersecurity mencakup praktik dan tooling untuk melindungi aplikasi dan jaringan dari ancaman; penting untuk audit dan mitigasi.",
      "tujuan": "Melindungi sistem dan data dari ancaman keamanan.",
      "manfaat": "Mengurangi risiko kebocoran data dan gangguan layanan.",
      "asal": "Bidang yang berkembang dari praktik keamanan jaringan, aplikasi, dan operasi TI.",
      "fungsi": "Vulnerability assessment, penetration testing, dan hardening sistem.",
      "kekurangan": "Membutuhkan investasi berkelanjutan dalam tooling dan proses.",
      "kelebihan": "Meningkatkan kepercayaan pengguna dan memitigasi risiko bisnis.",
      "seberapaBanyakPengguna": "Organisasi di berbagai industri menerapkan praktik cybersecurity.",
      "projectContoh": "Vulnerability assessment untuk banking application identifying critical flaws",
      "detailTambahan": {
        "expertise": ["OWASP Top 10", "Security Headers", "Encryption", "Access Control"],
        "certifications": "CEH, Security+"
      }
    },
  {
    "nama": "TypeScript",
    "tingkat": "Mahir",
    "icon": "📘",
    "level": 88,
    "warna": "#3178C6",
    "framework": ["Angular", "Next.js", "NestJS"],
    "tools": ["TypeScript Compiler", "ts-node", "Prisma"],
    "pengalaman": "4+ tahun membangun scalable enterprise applications dengan type safety. Lead developer untuk codebase monorepo dengan 500k+ LOC.",
    "penjelasan": "TypeScript menambahkan tipe statis ke JavaScript sehingga mengurangi bug pada aplikasi besar dan mempermudah refactor.",
    "tujuan": "Menambahkan tipe statis untuk meningkatkan keandalan dan maintainability pada kode JavaScript.",
    "manfaat": "Mengurangi bug runtime, mempermudah refactor, dan meningkatkan pengalaman editor dengan autocompletion/diagnostics.",
    "asal": "Dikembangkan dan dipelihara oleh Microsoft sebagai superset JavaScript.",
    "fungsi": "Memberikan sistem type-checking statis, definisi tipe dan tooling untuk pengembangan skala besar.",
    "kekurangan": "Memerlukan konfigurasi build tambahan dan learning curve untuk fitur tipe lanjutan seperti generics dan conditional types.",
    "kelebihan": "Meningkatkan kepercayaan kode, mempermudah refactor, dan integrasi tooling editor yang kuat.",
    "seberapaBanyakPengguna": "Sangat luas diadopsi oleh perusahaan dan proyek open-source; jutaan developer menggunakan TypeScript.",
    "projectContoh": "Sistem Design System dengan automated type generation dan monorepo architecture",
    "detailTambahan": {
      "expertise": ["Advanced Type System", "Decorators", "Generic Programming", "Type Inference"],
      "architecture": "Micro-frontends, Monorepo (NX), Module Federation"
    }
  },
  {
      "nama": "Cloud Architecture",
      "tingkat": "Lanjutan",
      "icon": "☁️",
      "level": 85,
      "warna": "#FF9900",
      "platform": ["AWS", "GCP", "Azure"],
      "layanan": ["EC2 & Lambda", "S3 & Cloud Storage", "RDS & Cloud SQL", "Kubernetes Engine"],
      "pengalaman": "3+ tahun mendesain dan mengimplementasikan cloud infrastructure untuk aplikasi scalable. Specialized dalam containerization dan serverless.",
      "tujuan": "Mendesain arsitektur cloud yang scalable, resilient, dan cost-efficient.",
      "manfaat": "Meningkatkan availability, skalabilitas, observability, dan efisiensi biaya pada sistem produksi.",
      "asal": "Praktik yang berkembang bersamaan dengan adopsi layanan cloud dari provider seperti AWS, GCP, dan Azure.",
      "fungsi": "Menentukan pola deployment, networking, security, dan operasional untuk sistem terdistribusi.",
      "kekurangan": "Menambah kompleksitas operasional, kebutuhan monitoring/observability, dan tantangan cost governance.",
      "kelebihan": "Memberi kemampuan autoscaling, global distribution, managed services, dan resiliency untuk aplikasi.",
      "seberapaBanyakPengguna": "Diadopsi luas oleh perusahaan digital dan startup untuk menjalankan layanan production.",
      "projectContoh": "Multi-region deployment dengan auto-scaling dan disaster recovery system",
      "detailTambahan": {
        "expertise": ["Infrastructure as Code", "CI/CD Pipeline", "Cost Optimization", "Security Hardening"],
        "tools": "Terraform, Docker, Helm Charts, Grafana"
      }
    }
  ],

  "metadata": {
    "lastUpdated": "2024-01-15",
    "version": "2.1", 
    "totalSkills": 10,
    "categories": ["bahasaSehariHari", "bahasaPemrograman"],
    "catatan": "Data telah diperkaya dengan detail tambahan seperti level CEFR untuk bahasa, tools spesifik, area keahlian, dan konteks pengalaman yang lebih mendalam."
  }
}